In [26]:
import pandas as pd
import numpy as np

In [3]:
credit = pd.read_csv(r"C:\Users\USER\Desktop\credit_csv\credit_card_transactions_2023.csv")

In [4]:
credit.head(4)

,CustomerID,TransactionID,TransactionDate,Amount,MerchantName,Category,PaymentMethod,CustomerAge,CustomerGender,CustomerLocation,CustomerIncome
0,1,1,2023-01-01 00:00:00,1875.83,Apple,Electronics,Google Pay,42,Other,San Jose,128058.94
1,2,2,2023-01-01 00:01:00,4753.82,Costco,Other,Credit Card,67,Other,San Antonio,130317.66
2,3,3,2023-01-01 00:02:00,3661.31,Walmart,Dining,Bank Transfer,39,Female,San Diego,37583.73
3,4,4,2023-01-01 00:03:00,2995.30,eBay,Utilities,Google Pay,56,Male,Phoenix,66107.10

In [5]:
credit = credit.rename(columns={"TransactionDate":"Date",
                              "CustomerAge":"Age",
                              "CustomerGender":"Gender",
                              "CustomerLocation":"Location",
                              "CustomerIncome":"Income"})

In [6]:
credit.head(5)

,CustomerID,TransactionID,Date,Amount,MerchantName,Category,PaymentMethod,Age,Gender,Location,Income
0,1,1,2023-01-01 00:00:00,1875.83,Apple,Electronics,Google Pay,42,Other,San Jose,128058.94
1,2,2,2023-01-01 00:01:00,4753.82,Costco,Other,Credit Card,67,Other,San Antonio,130317.66
2,3,3,2023-01-01 00:02:00,3661.31,Walmart,Dining,Bank Transfer,39,Female,San Diego,37583.73
3,4,4,2023-01-01 00:03:00,2995.30,eBay,Utilities,Google Pay,56,Male,Phoenix,66107.10
4,5,5,2023-01-01 00:04:00,784.31,Target,Travel,Debit Card,39,Other,San Diego,46409.56

#### Number of rows (records in the dataset)

In [7]:
credit.shape

(10000, 11)

#### Checking for duplicate

In [8]:
credit.duplicated().sum()

0

In [9]:
credit.dtypes

CustomerID         int64
TransactionID      int64
Date              object
Amount           float64
MerchantName      object
Category          object
PaymentMethod     object
Age                int64
Gender            object
Location          object
Income           float64
dtype: object

#### Changing the Date data-type

In [10]:
credit['Date'] = pd.to_datetime(credit['Date'])

In [11]:
credit.dtypes

CustomerID                int64
TransactionID             int64
Date             datetime64[ns]
Amount                  float64
MerchantName             object
Category                 object
PaymentMethod            object
Age                       int64
Gender                   object
Location                 object
Income                  float64
dtype: object

#### Heading to the dataframe

In [29]:
#credit.style.set_caption('Credit Dataset for Sales')

In [13]:
credit.head(3)

,CustomerID,TransactionID,Date,Amount,MerchantName,Category,PaymentMethod,Age,Gender,Location,Income
0,1,1,2023-01-01 00:00:00,1875.83,Apple,Electronics,Google Pay,42,Other,San Jose,128058.94
1,2,2,2023-01-01 00:01:00,4753.82,Costco,Other,Credit Card,67,Other,San Antonio,130317.66
2,3,3,2023-01-01 00:02:00,3661.31,Walmart,Dining,Bank Transfer,39,Female,San Diego,37583.73

#### 1.	What are the most common types of transactions among the customers?

In [14]:
credit['Category'].value_counts(ascending=False).head(4)

Category
Dining           1083
Clothing         1025
Entertainment    1020
Travel           1019
Name: count, dtype: int64

#### 2.	What is the average transaction amount for different customer age groups?

In [15]:
#credit.head(3)

In [16]:
#credit['Age'].max()
#credit['Age'].min()

In [17]:
bins = [0, 20, 30, 40, 50, 60, 70, 80]
labels = ['0-20', '21-30', '31-40', '41-50', '51-60', '61-70', '71-80']
credit['AgeGroup'] = pd.cut(credit['Age'], bins=bins, labels=labels, right=False)

# Calculate average transaction amount for each age group
avg_amount = credit.groupby('AgeGroup')['Amount'].mean().reset_index()
avg_amount

C:\Users\USER\AppData\Local\Temp\ipykernel_260\1964785005.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_amount = credit.groupby('AgeGroup')['Amount'].mean().reset_index()

  AgeGroup       Amount
0     0-20  2285.756154
1    21-30  2529.241202
2    31-40  2427.149630
3    41-50  2507.317748
4    51-60  2462.872013
5    61-70  2475.253956
6    71-80  2473.277551

#### 3.	Which regions have the highest average spending per transaction?

In [18]:
#credit.head(3)

In [19]:
Reg =credit.groupby(['Location'])
Avg_spe = Reg['Amount'].mean().sort_values(ascending=False)
Avg_spe

Location
Philadelphia    2512.472597
Chicago         2503.059725
San Antonio     2489.733853
New York        2482.629329
Phoenix         2477.499015
San Diego       2475.093533
Houston         2466.417573
San Jose        2452.921159
Dallas          2449.245617
Los Angeles     2424.222537
Name: Amount, dtype: float64

#### 4.What is the distribution of transaction amounts during different months of the year?

In [20]:
credit.head(3)

,CustomerID,TransactionID,Date,Amount,MerchantName,Category,PaymentMethod,Age,Gender,Location,Income,AgeGroup
0,1,1,2023-01-01 00:00:00,1875.83,Apple,Electronics,Google Pay,42,Other,San Jose,128058.94,41-50
1,2,2,2023-01-01 00:01:00,4753.82,Costco,Other,Credit Card,67,Other,San Antonio,130317.66,61-70
2,3,3,2023-01-01 00:02:00,3661.31,Walmart,Dining,Bank Transfer,39,Female,San Diego,37583.73,31-40

In [21]:
credit['month']=credit.Date.dt.month

In [22]:
credit.head(3)

,CustomerID,TransactionID,Date,Amount,MerchantName,Category,PaymentMethod,Age,Gender,Location,Income,AgeGroup,month
0,1,1,2023-01-01 00:00:00,1875.83,Apple,Electronics,Google Pay,42,Other,San Jose,128058.94,41-50,1
1,2,2,2023-01-01 00:01:00,4753.82,Costco,Other,Credit Card,67,Other,San Antonio,130317.66,61-70,1
2,3,3,2023-01-01 00:02:00,3661.31,Walmart,Dining,Bank Transfer,39,Female,San Diego,37583.73,31-40,1

In [23]:
credit.Category.unique()

array(['Electronics', 'Other', 'Dining', 'Utilities', 'Travel',
       'Entertainment', 'Clothing', 'Groceries', 'Education', 'Health'],
      dtype=object)

In [24]:
credit.Category.value_counts()

Category
Dining           1083
Clothing         1025
Entertainment    1020
Travel           1019
Education         990
Health            990
Other             989
Utilities         986
Electronics       959
Groceries         939
Name: count, dtype: int64

In [25]:
credit.PaymentMethod.value_counts()

PaymentMethod
Bank Transfer    1747
Apple Pay        1705
Debit Card       1652
Credit Card      1642
Google Pay       1632
PayPal           1622
Name: count, dtype: int64